BaseKinoteatr/src/Documents/ПродажаПродукции/ПродажаПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПродажаПродукции</name>
  <basedOn>Document.ЗаказПродукции</basedOn>
  <registerRecords>AccumulationRegister.ОстаткиПродукции</registerRecords>
  <registerRecords>AccumulationRegister.ПродажиПродукции</registerRecords>
  <attributes>
    <name>Кинотеатр</name>
    <type>
      <types>CatalogRef.Кинотеатры</types>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказПродукции</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Продукция</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Итого</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

BaseKinoteatr/src/AccumulationRegisters/ПродажиПродукции/ПродажиПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПродажиПродукции</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СтоимостьПродаж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Продукция</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Кинотеатр</name>
    <type>
      <types>CatalogRef.Кинотеатры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

BaseKinoteatr/src/AccumulationRegisters/ОстаткиПродукции/ОстаткиПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиПродукции</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Продукция</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Кинотеатр</name>
    <type>
      <types>CatalogRef.Кинотеатры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

BaseKinoteatr/src/Documents/ПродажаПродукции/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ПродажиПродукции 
	Движения.ПродажиПродукции.Записывать = Истина;
	Для Каждого ТекСтрокаПродукция Из Продукция Цикл
		Движение = Движения.ПродажиПродукции.Добавить();
		Движение.Период = Дата;
		Движение.Продукция = ТекСтрокаПродукция.Товар;
		Движение.Кинотеатр = Кинотеатр;
		Движение.СтоимостьПродаж = ТекСтрокаПродукция.Итого;
		Движение.Количество = ТекСтрокаПродукция.Количество;
	КонецЦикла;	
	
	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда
		Движения.ОстаткиПродукции.Записывать = Истина;
		
		// сгрупировать поля в табличной части документа по номенклатуре
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПродажаПродукцииПродукция.Товар КАК Товар,
		|	СУММА(ПродажаПродукцииПродукция.Количество) КАК Количество
		|ПОМЕСТИТЬ ДокТЧ
		|ИЗ
		|	Документ.ПродажаПродукции.Продукция КАК ПродажаПродукцииПродукция
		|ГДЕ
		|	ПродажаПродукцииПродукция.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажаПродукцииПродукция.Товар
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокТЧ.Товар КАК Товар,
		|	ДокТЧ.Количество КАК Количество
		|ИЗ
		|	ДокТЧ КАК ДокТЧ";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Движение = Движения.ОстаткиПродукции.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Товар = ВыборкаДетальныеЗаписи.Товар;
			Движение.Кинотеатр = Кинотеатр;
			Движение.Количество = ВыборкаДетальныеЗаписи.Количество;
		КонецЦикла;
		
		Движения.ОстаткиПродукции.БлокироватьДляИзменения = Истина;
		
		Движения.Записать();
		
		
		// запрос к остаткам - контроль остатков
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиПродукцииОстатки.Товар КАК Товар,
		|	ОстаткиПродукцииОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиПродукции.Остатки(
		|			&МоментВремени,
		|			Кинотеатр = &Кинотеатр
		|				И Товар В
		|					(ВЫБРАТЬ
		|						ДокТЧ.Товар КАК Товар
		|					ИЗ
		|						ДокТЧ КАК ДокТЧ)) КАК ОстаткиПродукцииОстатки
		|ГДЕ
		|	ОстаткиПродукцииОстатки.КоличествоОстаток < 0";
		
		Граница = Новый Граница(МоментВремени(), ВидГраницы.Включая);
		
		
		Запрос.УстановитьПараметр("Кинотеатр", Кинотеатр);
		Запрос.УстановитьПараметр("МоментВремени", Граница);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			Отказ=Истина;
			
			// порционно выдает данные
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				Сообщить("Мало продукции " + Выборка.Товар + ", нужно еще " + (-Выборка.КоличествоОстаток));
			КонецЦикла;
			
		КонецЕсли;
		
		
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Обходим строки и проверяем заполнение реквизита
	
	Для Индекс = 0 по Продукция.Количество()-1 Цикл
		СтрокаТовар = Продукция.Получить(Индекс);
		Если Не ЗначениеЗаполнено(СтрокаТовар.Товар) Тогда
			Сообщение = Новый СообщениеПользователю();
			Строка = Индекс + 1;
			Сообщение.Текст = "В строке " + Строка + " не заполнено значение товара";
			Сообщение.Поле = "Товары[" + Индекс + "].Товар";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
			
		ИначеЕсли Не ЗначениеЗаполнено(СтрокаТовар.Количество) Тогда
			Сообщение = Новый СообщениеПользователю();
			Строка = Индекс + 1;
			Сообщение.Текст = "В строке " + Строка + " не заполнено значение количества товара";
			Сообщение.Поле = "Товары[" + Индекс + "].Товар";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
			
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПродукции") Тогда
		// Заполнение шапки
		ИтогоКОплате = ДанныеЗаполнения.ИтогоКОплате;
		Кинотеатр = ДанныеЗаполнения.Кинотеатр;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаПродукция Из ДанныеЗаполнения.Продукция Цикл
			НоваяСтрока = Продукция.Добавить();
			НоваяСтрока.Итого = ТекСтрокаПродукция.Итого;
			НоваяСтрока.Количество = ТекСтрокаПродукция.Количество;
			НоваяСтрока.Товар = ТекСтрокаПродукция.Товар;
			НоваяСтрока.Цена = ТекСтрокаПродукция.Цена;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
